/**
 * update date 2019-12-11
 * @authors shikkya
 * @date    2019-12-11
 * @version $Id$
 */

var proData = [{
        name: "北京市",
        city: [{
            name: "北京市",
            district: ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "顺义区", "通州区", "大兴区", "房山区", "门头沟区", "昌平区", "平谷区", "密云区", "怀柔区", "延庆区", "其他"]
        }]
    },
    {
        name: "天津市",
        city: [{
            name: "天津市",
            district: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河区", "静海区", "蓟州区", "其他"]
        }]
    },
    {
        name: "上海市",
        city: [{
            name: "上海市",
            district: ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区", "其他"]
        }]
    },
    {
        name: "重庆市",
        city: [{
            name: "重庆市",
            district: ["渝中区", "万州区", "涪陵区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区", "潼南区", "荣昌区", "开州区", "梁平区", "武隆区", "城口县", "丰都县", "垫江县", "忠县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "其他"]
        }]
    },
    {
        name: "河北省",
        city: [{
                name: "石家庄市",
                district: ["长安区", "桥西区", "新华区", "井陉矿区", "裕华区", "藁城区", "鹿泉区", "栾城区", "井陉县", "正定县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "晋州市", "新乐市", "辛集市", "其他"]
            },
            {
                name: "唐山市",
                district: ["路北区", "路南区", "古冶区", "开平区", "丰南区", "丰润区", "曹妃甸区", "滦南县", "乐亭县", "迁西县", "玉田县", "遵化市", "迁安市", "滦州市", "其他"]
            },
            {
                name: "秦皇岛市",
                district: ["海港区", "山海关区", "北戴河区", "抚宁区", "青龙满族自治县", "昌黎县", "卢龙县", "其他"]
            },
            {
                name: "邯郸市",
                district: ["邯山区", "丛台区", "复兴区", "峰峰矿区", "肥乡区", "永年区", "临漳县", "成安县", "大名县", "涉县", "磁县", "邱县", "鸡泽县", "广平县", "馆陶县", "曲周县", "武安市", "魏县", "其他"]
            },
            {
                name: "邢台市",
                district: ["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市", "宁晋县", "其他"]
            },
            {
                name: "保定市",
                district: ["竞秀区", "莲池区", "满城区", "清苑区", "徐水区", "涞水县", "阜平县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "安国市", "高碑店市", "涿州市", "定州市", "其他"]
            },
            {
                name: "张家口市",
                district: ["桥东区", "桥西区", "宣化区", "下花园区", "崇礼区", "万全区", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "涿鹿县", "赤城县", "怀来县", "其他"]
            },
            {
                name: "承德市",
                district: ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县", "平泉市", "其他"]
            },
            {
                name: "沧州市",
                district: ["运河区", "新华区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "黄骅市", "河间市", "任丘市", "其他"]
            },
            {
                name: "廊坊市",
                district: ["广阳区", "安次区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市", "其他"]
            },
            {
                name: "衡水市",
                district: ["桃城区", "冀州区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "阜城县", "深州市", "景县", "其他"]
            }
        ]
    },
    {
        name: "山西省",
        city: [{
                name: "太原市",
                district: ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市", "其他"]
            },
            {
                name: "大同市",
                district: ["新荣区", "平城区", "云冈区", "云州区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "其他"]
            },
            {
                name: "朔州市",
                district: ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁市", "其他"]
            },
            {
                name: "忻州市",
                district: ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市", "其他"]
            },
            {
                name: "阳泉市",
                district: ["城区", "矿区", "郊区", "平定县", "盂县", "其他"]
            },
            {
                name: "吕梁市",
                district: ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市", "其他"]
            },
            {
                name: "晋中市",
                district: ["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市", "其他"]
            },
            {
                name: "长治市",
                district: ["潞州区", "上党区", "屯留区", "潞城区", "襄垣县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "其他"]
            },
            {
                name: "晋城市",
                district: ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市", "其他"]
            },
            {
                name: "临汾市",
                district: ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市", "其他"]
            },
            {
                name: "运城市",
                district: ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市", "其他"]
            }
        ]
    },
    {
        name: "辽宁省",
        city: [{
                name: "沈阳市",
                district: ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "浑南区", "沈北新区", "于洪区", "辽中区", "新民市", "康平县", "法库县", "其他"]
            },
            {
                name: "大连市",
                district: ["中山区", "西岗区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "普兰店区", "瓦房店市", "庄河市", "长海县", "其他"]
            },
            {
                name: "鞍山市",
                district: ["铁东区", "铁西区", "立山区", "千山区", "海城市", "台安县", "岫岩满族自治县", "其他"]
            },
            {
                name: "抚顺市",
                district: ["新抚区", "顺城区", "望花区", "东洲区", "抚顺县", "新宾满族自治县", "清原满族自治县", "其他"]
            },
            {
                name: "本溪市",
                district: ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县", "其他"]
            },
            {
                name: "丹东市",
                district: ["元宝区", "振兴区", "振安区", "东港市", "凤城市", "宽甸满族自治县", "其他"]
            },
            {
                name: "锦州市",
                district: ["古塔区", "凌河区", "太和区", "凌海市", "北镇市", "黑山县", "义县", "其他"]
            },
            {
                name: "营口市",
                district: ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市", "其他"]
            },
            {
                name: "阜新市",
                district: ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县", "其他"]
            },
            {
                name: "辽阳市",
                district: ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "灯塔市", "辽阳县", "其他"]
            },
            {
                name: "盘锦市",
                district: ["双台子区", "兴隆台区", "大洼区", "盘山县", "其他"]
            },
            {
                name: "铁岭市",
                district: ["银州区", "清河区", "调兵山市", "开原市", "铁岭县", "昌图县", "西丰县", "其他"]
            },
            {
                name: "朝阳市",
                district: ["双塔区", "龙城区", "北票市", "凌源市", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "其他"]
            },
            {
                name: "葫芦岛市",
                district: ["连山区", "龙港区", "南票区", "兴城市", "绥中县", "建昌县", "其他"]
            }
        ]
    },
    {
        name: "吉林省",
        city: [{
                name: "长春市",
                district: ["南关区", "朝阳区", "绿园区", "二道区", "双阳区", "宽城区", "九台区", "榆树市", "德惠市", "农安县", "其他"]
            },
            {
                name: "吉林市",
                district: ["船营区", "龙潭区", "昌邑区", "丰满区", "磐石市", "桦甸市", "蛟河市", "舒兰市", "永吉县", "其他"]
            },
            {
                name: "延边朝鲜族自治州",
                district: ["延吉市", "图们市", "敦化市", "和龙市", "珲春市", "龙井市", "汪清县", "安图县", "其他"]
            },
            {
                name: "四平市",
                district: ["铁西区", "铁东区", "公主岭市", "双辽市", "梨树县", "伊通满族自治县", "其他"]
            },
            {
                name: "通化市",
                district: ["东昌区", "二道江区", "集安市", "通化县", "辉南县", "柳河县", "梅河口市", "其他"]
            },
            {
                name: "白城市",
                district: ["洮北区", "洮南市", "大安市", "镇赉县", "通榆县", "其他"]
            },
            {
                name: "辽源市",
                district: ["龙山区", "西安区", "东丰县", "东辽县", "其他"]
            },
            {
                name: "松原市",
                district: ["宁江区", "扶余市", "乾安县", "长岭县", "前郭尔罗斯蒙古族自治县", "其他"]
            },
            {
                name: "白山市",
                district: ["浑江区", "江源区", "临江市", "抚松县", "靖宇县", "长白朝鲜族自治县", "其他"]
            }
        ]
    },
    {
        name: "黑龙江省",
        city: [{
                name: "哈尔滨市",
                district: ["道里区", "南岗区", "道外区", "平房区", "松北区", "香坊区", "呼兰区", "阿城区", "双城区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县", "尚志市", "五常市", "其他"]
            },
            {
                name: "齐齐哈尔市",
                district: ["龙沙区", "建华区", "铁锋区", "富拉尔基区", "昂昂溪区", "碾子山区", "梅里斯达斡尔族区", "讷河市", "甘南县", "龙江县", "克山县", "克东县", "依安县", "拜泉县", "泰来县", "富裕县", "其他"]
            },
            {
                name: "牡丹江市",
                district: ["东安区", "西安区", "爱民区", "阳明区", "绥芬河市", "海林市", "宁安市", "穆棱市", "东宁市", "林口县", "其他"]
            },
            {
                name: "佳木斯市",
                district: ["富锦市", "同江市", "桦南县", "桦川县", "汤原县", "抚远市", "前进区", "向阳区", "东风区", "郊区", "其他"]
            },
            {
                name: "大庆市",
                district: ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县", "其他"]
            },
            {
                name: "鸡西市",
                district: ["密山市", "虎林市", "鸡东县", "鸡冠区", "恒山区", "滴道区", "城子河区", "梨树区", "麻山区", "其他"]
            },
            {
                name: "双鸭山市",
                district: ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "宝清县", "友谊县", "饶河县", "其他"]
            },
            {
                name: "伊春市",
                district: ["伊美区", "乌翠区", "友好区", "金林区", "铁力市", "嘉荫县", "汤旺县", "丰林县", "南岔县", "大箐山县", "其他"]
            },
            {
                name: "七台河市",
                district: ["桃山区", "新兴区", "茄子河区", "勃利县", "其他"]
            },
            {
                name: "鹤岗市",
                district: ["绥滨县", "萝北县", "东山区", "兴安区", "向阳区", "工农区", "南山区", "兴山区", "其他"]
            },
            {
                name: "黑河市",
                district: ["爱辉区", "北安市", "五大连池市", "嫩江市", "逊克县", "孙吴县", "其他"]
            },
            {
                name: "绥化市",
                district: ["北林区", "肇东市", "安达市", "海伦市", "兰西县", "庆安县", "绥棱县", "望奎县", "明水县", "青冈县", "其他"]
            },
            {
                name: "大兴安岭地区",
                district: ["加格达奇区", "松岭区", "呼中区", "新林区", "漠河市", "呼玛县", "塔河县", "其他"]
            }
        ]
    },
    {
        name: "江苏省",
        city: [{
                name: "南京市",
                district: ["玄武区", "秦淮区", "鼓楼区", "建邺区", "栖霞区", "雨花台区", "江宁区", "浦口区", "六合区", "溧水区", "高淳区", "其他"]
            },
            {
                name: "无锡市",
                district: ["滨湖区", "梁溪区", "新吴区", "锡山区", "惠山区", "江阴市", "宜兴市", "其他"]
            },
            {
                name: "徐州市",
                district: ["云龙区", "鼓楼区", "贾汪区", "泉山区", "铜山区", "丰县", "沛县", "睢宁县", "邳州市", "新沂市", "其他"]
            },
            {
                name: "常州市",
                district: ["天宁区", "钟楼区", "新北区", "武进区", "金坛区", "溧阳市", "其他"]
            },
            {
                name: "苏州市",
                district: ["姑苏区", "虎丘区", "吴中区", "相城区", "吴江区", "昆山市", "常熟市", "张家港市", "太仓市", "其他"]
            },
            {
                name: "南通市",
                district: ["崇川区", "港闸区", "通州区", "如东县", "如皋市", "海门市", "启东市", "海安市", "其他"]
            },
            {
                name: "连云港市",
                district: ["连云区", "海州区", "赣榆区", "东海县", "灌云县", "灌南县", "其他"]
            },
            {
                name: "淮安市",
                district: ["清江浦区", "淮安区", "淮阴区", "洪泽区", "涟水县", "盱眙县", "金湖县", "其他"]
            },
            {
                name: "盐城市",
                district: ["亭湖区", "盐都区", "大丰区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市", "其他"]
            },
            {
                name: "扬州市",
                district: ["广陵区", "邗江区", "江都区", "宝应县", "仪征市", "高邮市", "其他"]
            },
            {
                name: "镇江市",
                district: ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市", "其他"]
            },
            {
                name: "泰州市",
                district: ["海陵区", "高港区", "姜堰区", "兴化市", "靖江市", "泰兴市", "其他"]
            },
            {
                name: "宿迁市",
                district: ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县", "其他"]
            }
        ]
    },
    {
        name: "浙江省",
        city: [{
                name: "杭州市",
                district: ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "余杭区", "萧山区", "富阳区", "临安区", "建德市", "桐庐县", "淳安县", "其他"]
            },
            {
                name: "宁波市",
                district: ["海曙区", "江北区", "北仑区", "镇海区", "鄞州区", "奉化区", "余姚市", "慈溪市", "象山县", "宁海县", "其他"]
            },
            {
                name: "温州市",
                district: ["鹿城区", "龙湾区", "瓯海区", "洞头区", "瑞安市", "乐清市", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "龙港市", "其他"]
            },
            {
                name: "绍兴市",
                district: ["越城区", "柯桥区", "上虞区", "诸暨市", "嵊州市", "新昌县", "其他"]
            },
            {
                name: "湖州市",
                district: ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县", "其他"]
            },
            {
                name: "嘉兴市",
                district: ["南湖区", "秀洲区", "海宁市", "平湖市", "桐乡市", "嘉善县", "海盐县", "其他"]
            },
            {
                name: "金华市",
                district: ["婺城区", "金东区", "兰溪市", "东阳市", "永康市", "义乌市", "武义县", "浦江县", "磐安县", "其他"]
            },
            {
                name: "衢州市",
                district: ["柯城区", "衢江区", "江山市", "常山县", "开化县", "龙游县", "其他"]
            },
            {
                name: "台州市",
                district: ["椒江区", "黄岩区", "路桥区", "临海市", "温岭市", "玉环市", "三门县", "天台县", "仙居县", "其他"]
            },
            {
                name: "丽水市",
                district: ["莲都区", "龙泉市", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "其他"]
            },
            {
                name: "舟山市",
                district: ["定海区", "普陀区", "岱山县", "嵊泗县", "其他"]
            }
        ]
    },
    {
        name: "安徽省",
        city: [{
                name: "合肥市",
                district: ["瑶海区", "庐阳区", "蜀山区", "包河区", "肥东县", "肥西县", "长丰县", "庐江县", "巢湖市", "其他"]
            },
            {
                name: "芜湖市",
                district: ["镜湖区", "弋江区", "鸠江区", "三山区", "无为县", "芜湖县", "繁昌县", "南陵县", "其他"]
            },
            {
                name: "蚌埠市",
                district: ["龙子湖区", "蚌山区", "禹会区", "淮上区", "五河县", "固镇县", "怀远县", "其他"]
            },
            {
                name: "淮南市",
                district: ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县", "寿县", "其他"]
            },
            {
                name: "马鞍山市",
                district: ["花山区", "雨山区", "博望区", "含山县", "和县", "当涂县", "其他"]
            },
            {
                name: "淮北市",
                district: ["相山区", "杜集区", "烈山区", "濉溪县", "其他"]
            },
            {
                name: "铜陵市",
                district: ["铜官区", "郊区", "义安区", "枞阳县", "其他"]
            },
            {
                name: "安庆市",
                district: ["迎江区", "大观区", "宜秀区", "桐城市", "潜山市", "怀宁县", "太湖县", "宿松县", "望江县", "岳西县", "其他"]
            },
            {
                name: "黄山市",
                district: ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县", "其他"]
            },
            {
                name: "阜阳市",
                district: ["颍州区", "颍泉区", "颍东区", "颍上县", "界首市", "临泉县", "阜南县", "太和县", "其他"]
            },
            {
                name: "宿州市",
                district: ["埇桥区", "萧县", "砀山县", "灵璧县", "泗县", "其他"]
            },
            {
                name: "滁州市",
                district: ["琅琊区", "南谯区", "天长市", "明光市", "全椒县", "来安县", "凤阳县", "定远县", "其他"]
            },
            {
                name: "六安市",
                district: ["金安区", "裕安区", "叶集区", "霍邱县", "霍山县", "金寨县", "舒城县", "其他"]
            },
            {
                name: "宣城市",
                district: ["宣州区", "郎溪县", "广德市", "宁国市", "泾县", "绩溪县", "旌德县", "其他"]
            },
            {
                name: "池州市",
                district: ["贵池区", "青阳县", "石台县", "东至县", "其他"]
            },
            {
                name: "亳州市",
                district: ["谯城区", "蒙城县", "涡阳县", "利辛县", "其他"]
            }
        ]
    },
    {
        name: "福建省",
        city: [{
                name: "福州市",
                district: ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "长乐区", "福州新区", "福清市", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "其他"]
            },
            {
                name: "厦门市",
                district: ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区", "其他"]
            },
            {
                name: "漳州市",
                district: ["东铺头街道", "龙文区", "漳州招商局经济技术开发区", "漳州台商投资区", "漳州高新技术产业开发区", "常山华侨经济开发区", "古雷港经济开发区", "龙海市", "漳浦县", "南靖县", "云霄县", "平和县", "华安县", "长泰县", "诏安县", "东山县", "其他"]
            },
            {
                name: "泉州市",
                district: ["丰泽区", "鲤城区", "洛江区", "泉港区", "泉州经济技术开发区", "泉州台商投资区", "泉州高新技术产业开发区", "石狮市", "晋江市", "南安市", "惠安县", "安溪县", "永春县", "德化县", "金门县", "其他"]
            },
            {
                name: "三明市",
                district: ["梅列区", "三元区", "永安市", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "其他"]
            },
            {
                name: "莆田市",
                district: ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县", "其他"]
            },
            {
                name: "南平市",
                district: ["延平区", "建阳市", "邵武市", "武夷山市", "建瓯市", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "其他"]
            },
            {
                name: "龙岩市",
                district: ["新罗区", "永定区", "漳平市", "长汀县", "上杭县", "武平县", "连城县", "其他"]
            },
            {
                name: "宁德市",
                district: ["蕉城区", "东侨经济技术开发区", "福安市", "福鼎市", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "其他"]
            },
            {
                name: "平潭综合实验区",
                district: ["平潭县", "其他"]
            }
        ]
    },
    {
        name: "江西省",
        city: [{
                name: "南昌市",
                district: ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "新建区", "南昌县", "安义县", "进贤县", "其他"]
            },
            {
                name: "九江市",
                district: ["浔阳区", "濂溪区", "柴桑区", "永修县", "德安县", "都昌县", "湖口县", "彭泽县", "武宁县", "修水县", "瑞昌市", "共青城市", "庐山市", "其他"]
            },
            {
                name: "上饶市",
                district: ["信州区", "广丰区", "广信区", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", "德兴市", "其他"]
            },
            {
                name: "抚州市",
                district: ["临川区", "东乡区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "广昌县", "其他"]
            },
            {
                name: "宜春市",
                district: ["袁州区", "高安市", "丰城市", "樟树市", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", "其他"]
            },
            {
                name: "吉安市",
                district: ["吉州区", "青原区", "吉安县", "井冈山市", "吉水县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", "峡江县", "其他"]
            },
            {
                name: "赣州市",
                district: ["章贡区", "南康区", "赣县区", "信丰县", "大余县", "龙南县", "定南县", "全南县", "寻乌县", "安远县", "瑞金市", "宁都县", "于都县", "会昌县", "石城县", "上犹县", "兴国县", "崇义县", "其他"]
            },
            {
                name: "景德镇市",
                district: ["珠山区", "昌江区", "浮梁县", "乐平市", "其他"]
            },
            {
                name: "萍乡市",
                district: ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县", "其他"]
            },
            {
                name: "新余市",
                district: ["渝水区", "分宜县", "其他"]
            },
            {
                name: "鹰潭市",
                district: ["月湖区", "余江区", "贵溪市", "其他"]
            }
        ]
    },
    {
        name: "山东省",
        city: [{
                name: "济南市",
                district: ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "章丘区", "济阳区", "莱芜区", "钢城区", "平阴县", "商河县", "其他"]
            },
            {
                name: "青岛市",
                district: ["市南区", "市北区", "李沧区", "城阳区", "崂山区", "黄岛区", "即墨区", "胶州市", "平度市", "莱西市", "其他"]
            },
            {
                name: "淄博市",
                district: ["张店区", "淄川区", "周村区", "博山区", "临淄区", "桓台县", "高青县", "沂源县", "其他"]
            },
            {
                name: "枣庄市",
                district: ["薛城区", "市中区", "峄城区", "山亭区", "台儿庄区", "滕州市", "其他"]
            },
            {
                name: "东营市",
                district: ["东营区", "河口区", "垦利区", "广饶县", "利津县", "其他"]
            },
            {
                name: "烟台市",
                district: ["莱山区", "芝罘区", "福山区", "牟平区", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市", "长岛县", "其他"]
            },
            {
                name: "潍坊市",
                district: ["奎文区", "潍城区", "寒亭区", "坊子区", "诸城市", "青州市", "寿光市", "安丘市", "昌邑市", "高密市", "临朐县", "昌乐县", "其他"]
            },
            {
                name: "济宁市",
                district: ["任城区", "兖州区", "邹城市", "曲阜市", "嘉祥县", "汶上县", "梁山县", "微山县", "鱼台县", "金乡县", "泗水县", "其他"]
            },
            {
                name: "泰安市",
                district: ["泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县", "东平县", "其他"]
            },
            {
                name: "威海市",
                district: ["环翠区", "文登区", "荣成市", "乳山市", "其他"]
            },
            {
                name: "日照市",
                district: ["东港区", "岚山区", "五莲县", "莒县", "其他"]
            },
            {
                name: "滨州市",
                district: ["滨城区", "沾化区", "邹平市", "惠民县", "博兴县", "阳信县", "无棣县", "其他"]
            },
            {
                name: "德州市",
                district: ["德城区", "陵城区", "乐陵市", "禹城市", "临邑县", "平原县", "夏津县", "武城县", "庆云县", "宁津县", "齐河县", "其他"]
            },
            {
                name: "聊城市",
                district: ["东昌府区", "临清市", "茌平区", "东阿县", "高唐县", "阳谷县", "冠县", "莘县", "其他"]
            },
            {
                name: "临沂市",
                district: ["兰山区", "河东区", "罗庄区", "兰陵县", "郯城县", "莒南县", "沂水县", "蒙阴县", "平邑县", "沂南县", "临沭县", "费县", "其他"]
            },
            {
                name: "菏泽市",
                district: ["牡丹区", "定陶区", "曹县", "单县", "巨野县", "成武县", "郓城县", "鄄城县", "东明县", "其他"]
            }
        ]
    },
    {
        name: "河南省",
        city: [{
                name: "郑州市",
                district: ["中原区", "二七区", "金水区", "惠济区", "管城区", "上街区", "巩义市", "新郑市", "登封市", "荥阳市", "新密市", "中牟县", "其他"]
            },
            {
                name: "开封市",
                district: ["龙亭区", "鼓楼区", "禹王台区", "顺河区", "祥符区", "兰考县", "通许县", "杞县", "尉氏县", "其他"]
            },
            {
                name: "洛阳市",
                district: ["涧西区", "西工区", "老城区", "瀍河区", "洛龙区", "吉利区", "偃师市", "宜阳县", "孟津县", "新安县", "洛宁县", "栾川县", "伊川县", "汝阳县", "嵩县", "其他"]
            },
            {
                name: "平顶山市",
                district: ["新华区", "卫东区", "石龙区", "湛河区", "汝州市", "舞钢市", "鲁山县", "宝丰县", "叶县", "郏县", "其他"]
            },
            {
                name: "安阳市",
                district: ["文峰区", "北关区", "殷都区", "龙安区", "林州市", "安阳县", "滑县", "汤阴县", "内黄县", "其他"]
            },
            {
                name: "鹤壁市",
                district: ["鹤山区", "山城区", "淇滨区", "浚县", "淇县", "其他"]
            },
            {
                name: "新乡市",
                district: ["红旗区", "卫滨区", "牧野区", "凤泉区", "卫辉市", "辉县市", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣市", "其他"]
            },
            {
                name: "焦作市",
                district: ["山阳区", "中站区", "解放区", "马村区", "沁阳市", "孟州市", "修武县", "博爱县", "武陟县", "温县", "其他"]
            },
            {
                name: "濮阳市",
                district: ["华龙区", "濮阳县", "清丰县", "南乐县", "台前县", "范县", "其他"]
            },
            {
                name: "许昌市",
                district: ["魏都区", "建安区", "禹州市", "长葛市", "鄢陵县", "襄城县", "其他"]
            },
            {
                name: "漯河市",
                district: ["郾城区", "源汇区", "召陵区", "舞阳县", "临颍县", "其他"]
            },
            {
                name: "三门峡市",
                district: ["湖滨区", "陕州区", "灵宝市", "义马市", "渑池县", "卢氏县", "其他"]
            },
            {
                name: "商丘市",
                district: ["睢阳区", "梁园区", "永城市", "民权县", "宁陵县", "柘城县", "虞城县", "夏邑县", "睢县", "其他"]
            },
            {
                name: "周口市",
                district: ["川汇区", "项城市", "鹿邑县", "扶沟县", "西华县", "商水县", "沈丘县", "淮阳区", "郸城县", "太康县", "其他"]
            },
            {
                name: "驻马店市",
                district: ["驿城区", "新蔡县", "西平县", "遂平县", "平舆县", "上蔡县", "正阳县", "泌阳县", "确山县", "汝南县", "其他"]
            },
            {
                name: "南阳市",
                district: ["宛城区", "卧龙区", "邓州市", "南召县", "西峡县", "方城县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "其他"]
            },
            {
                name: "信阳市",
                district: ["浉河区", "平桥区", "固始县", "罗山县", "光山县", "潢川县", "淮滨县", "商城县", "新县", "息县", "其他"]
            },
            {
                name: "济源市",
                district: ["天坛街道", "沁园街道", "北海街道", "济水街道", "玉泉街道", "五龙口镇", "克井镇", "邵原镇", "坡头镇", "轵城镇", "承留镇", "大峪镇", "梨林镇", "思礼镇", "王屋镇", "下冶镇", "其他"]
            }
        ]
    },
    {
        name: "湖北省",
        city: [{
                name: "武汉市",
                district: ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "蔡甸区", "江夏区", "黄陂区", "新洲区", "东西湖区", "汉南区", "其他"]
            },
            {
                name: "黄石市",
                district: ["大冶市", "阳新县", "黄石港区", "西塞山区", "下陆区", "铁山区", "其他"]
            },
            {
                name: "十堰市",
                district: ["张湾区", "茅箭区", "郧阳区", "丹江口市", "郧西县", "竹山县", "竹溪县", "房县", "其他"]
            },
            {
                name: "宜昌市",
                district: ["远安县", "兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "宜都市", "枝江市", "当阳市", "夷陵区", "西陵区", "伍家岗区", "点军区", "猇亭区", "其他"]
            },
            {
                name: "襄阳市",
                district: ["襄城", "樊城", "襄州", "枣阳", "宜城", "老河口", "南漳", "保康", "谷城", "其他"]
            },
            {
                name: "鄂州市",
                district: ["鄂城区", "华容区", "梁子湖区", "其他"]
            },
            {
                name: "荆门市",
                district: ["京山市", "沙洋县", "钟祥市", "东宝区", "掇刀区", "其他"]
            },
            {
                name: "孝感市",
                district: ["孝南区", "云梦县", "孝昌县", "大悟县", "应城市", "安陆市", "汉川市", "其他"]
            },
            {
                name: "荆州市",
                district: ["荆州区", "沙市", "江陵县", "公安县", "监利县", "松滋市", "石首市", "洪湖市", "其他"]
            },
            {
                name: "黄冈市",
                district: ["黄州区", "麻城市", "武穴市", "团风县", "浠水县", "罗田县", "英山县", "蕲春县", "黄梅县", "红安县", "其他"]
            },
            {
                name: "咸宁市",
                district: ["嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市", "咸安区", "其他"]
            },
            {
                name: "随州市",
                district: ["曾都区", "随县", "广水市", "其他"]
            },
            {
                name: "恩施土家族苗族自治州",
                district: ["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县", "其他"]
            },
            {
                name: "仙桃市",
                district: ["仙桃市", "其他"]
            },
            {
                name: "潜江市",
                district: ["潜江市", "其他"]
            },
            {
                name: "天门市",
                district: ["天门市", "其他"]
            },
            {
                name: "神农架林区",
                district: ["神农架林区", "其他"]
            }
        ]
    },
    {
        name: "湖南省",
        city: [{
                name: "长沙市",
                district: ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "望城区", "宁乡市", "浏阳市", "长沙县", "其他"]
            },
            {
                name: "株洲市",
                district: ["天元区", "芦淞区", "荷塘区", "石峰区", "渌口区", "攸县", "茶陵县", "炎陵县", "醴陵市", "其他"]
            },
            {
                name: "湘潭市",
                district: ["雨湖区", "岳塘区", "湘乡市", "韶山市", "湘潭县", "其他"]
            },
            {
                name: "衡阳市",
                district: ["雁峰区", "石鼓区", "珠晖区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市", "其他"]
            },
            {
                name: "邵阳市",
                district: ["双清区", "大祥区", "北塔区", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县", "武冈市", "邵东市", "其他"]
            },
            {
                name: "岳阳市",
                district: ["岳阳楼区", "云溪区", "君山区", "湘阴县", "岳阳县", "华容县", "平江县", "汨罗市", "临湘市", "其他"]
            },
            {
                name: "常德市",
                district: ["武陵区", "鼎城区", "安乡县", "汉寿县", "桃源县", "临澧县", "石门县", "澧县", "津市市", "其他"]
            },
            {
                name: "张家界市",
                district: ["永定区", "武陵源区", "慈利县", "桑植县", "其他"]
            },
            {
                name: "益阳市",
                district: ["资阳区", "赫山区", "安化县", "桃江县", "南县", "沅江市", "其他"]
            },
            {
                name: "娄底市",
                district: ["娄星区", "冷水江市", "涟源市", "双峰县", "新化县", "其他"]
            },
            {
                name: "郴州市",
                district: ["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市", "其他"]
            },
            {
                name: "永州市",
                district: ["零陵区", "冷水滩区", "双牌县", "祁阳县", "东安县", "道县", "宁远县", "新田县", "蓝山县", "江永县", "江华瑶族自治县", "其他"]
            },
            {
                name: "怀化市",
                district: ["鹤城区", "中方县", "洪江市", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县", "洪江管理区", "其他"]
            },
            {
                name: "湘西土家族苗族自治州",
                district: ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县", "其他"]
            },
        ]
    },
    {
        name: "广东省",
        city: [{
                name: "广州市",
                district: ["越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "花都区", "番禺区", "南沙区", "增城区", "从化区", "其他"]
            },
            {
                name: "深圳市",
                district: ["福田区", "罗湖区", "南山区", "盐田区", "宝安区", "龙岗区", "龙华区", "坪山区", "光明区", "其他"]
            },
            {
                name: "珠海市",
                district: ["香洲区", "斗门区", "金湾区", "其他"]
            },
            {
                name: "汕头市",
                district: ["金平区", "龙湖区", "濠江区", "潮南区", "潮阳区", "澄海区", "南澳县", "其他"]
            },
            {
                name: "佛山市",
                district: ["禅城区", "高明区", "三水区", "南海区", "顺德区", "其他"]
            },
            {
                name: "韶关市",
                district: ["浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "仁化县", "翁源县", "新丰县", "乳源瑶族自治县", "其他"]
            },
            {
                name: "湛江市",
                district: ["赤坎区", "霞山区", "坡头区", "麻章区", "廉江市", "吴川市", "雷州市", "遂溪县", "徐闻县", "其他"]
            },
            {
                name: "肇庆市",
                district: ["端州区", "鼎湖区", "高要区", "四会市", "广宁县", "怀集县", "封开县", "德庆县", "其他"]
            },
            {
                name: "江门市",
                district: ["江海区", "蓬江区", "新会区", "台山市", "鹤山市", "开平市", "恩平市", "其他"]
            },
            {
                name: "茂名市",
                district: ["茂南区", "电白区", "高州市", "化州市", "信宜市", "其他"]
            },
            {
                name: "惠州市",
                district: ["惠城区", "惠阳区", "博罗县", "龙门县", "惠东县", "其他"]
            },
            {
                name: "梅州市",
                district: ["梅江区", "梅县区", "兴宁市", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "其他"]
            },
            {
                name: "汕尾市",
                district: ["城区", "陆丰市", "海丰县", "陆河县", "其他"]
            },
            {
                name: "河源市",
                district: ["源城区", "龙川县", "连平县", "东源县", "和平县", "紫金县", "其他"]
            },
            {
                name: "阳江市",
                district: ["江城区", "阳东区", "阳春市", "阳西县", "其他"]
            },
            {
                name: "清远市",
                district: ["清城区", "清新区", "英德市", "连州市", "佛冈县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "其他"]
            },
            {
                name: "东莞市",
                district: ["东莞市", "其他"]
            },
            {
                name: "中山市",
                district: ["中山市", "其他"]
            },
            {
                name: "潮州市",
                district: ["湘桥区", "潮安区", "饶平县", "其他"]
            },
            {
                name: "揭阳市",
                district: ["榕城区", "揭东区", "普宁市", "惠来县", "揭西县", "其他"]
            },
            {
                name: "云浮市",
                district: ["云城区", "云安区", "罗定市", "新兴县", "郁南县", "其他"]
            }
        ]
    },
    {
        name: "海南省",
        city: [{
                name: "海口市",
                district: ["秀英区", "龙华区", "琼山区", "美兰区", "其他"]
            },
            {
                name: "三亚市",
                district: ["崖州区", "天涯区", "吉阳区", "海棠区", "其他"]
            },
            {
                name: "三沙市",
                district: ["三沙市", "其他"]
            },
            {
                name: "儋州市",
                district: ["儋州市", "其他"]
            },
            {
                name: "定安县",
                district: ["定安县", "其他"]
            },
            {
                name: "屯昌县",
                district: ["屯昌县", "其他"]
            },
            {
                name: "澄迈县",
                district: ["澄迈县", "其他"]
            },
            {
                name: "临高县",
                district: ["临高县", "其他"]
            },
            {
                name: "五指山市",
                district: ["五指山市", "其他"]
            },
            {
                name: "文昌市",
                district: ["文昌市", "其他"]
            },
            {
                name: "琼海市",
                district: ["琼海市", "其他"]
            },
            {
                name: "万宁市",
                district: ["万宁市", "其他"]
            },
            {
                name: "东方市",
                district: ["东方市", "其他"]
            },
            {
                name: "白沙黎族自治县",
                district: ["白沙黎族自治县", "其他"]
            },
            {
                name: "昌江黎族自治县",
                district: ["昌江黎族自治县", "其他"]
            },
            {
                name: "乐东黎族自治县",
                district: ["乐东黎族自治县", "其他"]
            },
            {
                name: "陵水黎族自治县",
                district: ["陵水黎族自治县", "其他"]
            },
            {
                name: "保亭黎族苗族自治县",
                district: ["保亭黎族苗族自治县", "其他"]
            },
            {
                name: "琼中黎族苗族自治县",
                district: ["琼中黎族苗族自治县", "其他"]
            },
            {
                name: "洋浦经济开发区",
                district: ["干冲区", "新英湾区", "三都区", "其他"]
            }
        ]
    },
    {
        name: "四川省",
        city: [{
                name: "成都市",
                district: ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "青白江区", "龙泉驿区", "新都区", "温江区", "双流区", "郫都区", "都江堰市", "彭州市", "崇州市", "邛崃市", "简阳市", "金堂县", "大邑县", "蒲江县", "新津县", "其他"]
            },
            {
                name: "绵阳市",
                district: ["涪城区", "游仙区", "安州区", "江油市", "梓潼县", "三台县", "盐亭县", "平武县", "北川羌族自治县", "其他"]
            },
            {
                name: "自贡市",
                district: ["自流井区", "贡井区", "大安区", "沿滩区", "荣县", "富顺县", "其他"]
            },
            {
                name: "攀枝花市",
                district: ["东区", "西区", "仁和区", "米易县", "盐边县", "其他"]
            },
            {
                name: "泸州市",
                district: ["江阳区", "龙马潭区", "纳溪区", "泸县", "合江县", "叙永县", "古蔺县", "其他"]
            },
            {
                name: "德阳市",
                district: ["旌阳区", "罗江区", "广汉市", "什邡市", "绵竹市", "中江县", "其他"]
            },
            {
                name: "广元市",
                district: ["利州区", "昭化区", "朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县", "其他"]
            },
            {
                name: "遂宁市",
                district: ["船山区", "安居区", "射洪市", "蓬溪县", "大英县", "其他"]
            },
            {
                name: "内江市",
                district: ["市中区", "东兴区", "隆昌市", "资中县", "威远县", "其他"]
            },
            {
                name: "乐山市",
                district: ["市中区", "沙湾区", "五通桥区", "金口河区", "峨眉山市", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", "其他"]
            },
            {
                name: "资阳市",
                district: ["雁江区", "安岳县", "乐至县", "其他"]
            },
            {
                name: "宜宾市",
                district: ["叙州区", "翠屏区", "南溪区", "江安县", "长宁县", "高县", "筠连县", "珙县", "兴文县", "屏山县", "其他"]
            },
            {
                name: "南充市",
                district: ["顺庆区", "高坪区", "嘉陵区", "阆中市", "西充县", "南部县", "蓬安县", "营山县", "仪陇县", "其他"]
            },
            {
                name: "达州市",
                district: ["通川区", "达川区", "万源市", "渠县", "大竹县", "宣汉县", "开江县", "其他"]
            },
            {
                name: "雅安市",
                district: ["雨城区", "名山区", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县", "其他"]
            },
            {
                name: "阿坝藏族羌族自治州",
                district: ["马尔康市", "金川县", "小金县", "阿坝县", "若尔盖县", "红原县", "壤塘县", "汶川县", "理县", "茂县", "松潘县", "九寨沟县", "黑水县", "其他"]
            },
            {
                name: "甘孜藏族自治州",
                district: ["康定市", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "炉霍县", "甘孜县", "新龙县", "德格县", "白玉县", "石渠县", "色达县", "理塘县", "巴塘县", "乡城县", "稻城县", "得荣县", "其他"]
            },
            {
                name: "凉山彝族自治州",
                district: ["西昌市", "德昌县", "会理县", "会东县", "宁南县", "普格县", "布拖县", "昭觉县", "金阳县", "雷波县", "美姑县", "甘洛县", "越西县", "喜德县", "冕宁县", "盐源县", "木里藏族自治县", "其他"]
            },
            {
                name: "广安市",
                district: ["广安区", "前锋区", "华蓥市", "岳池县", "武胜县", "邻水县", "其他"]
            },
            {
                name: "巴中市",
                district: ["巴州区", "恩阳区", "平昌县", "通江县", "南江县", "其他"]
            },
            {
                name: "眉山市",
                district: ["东坡区", "彭山区", "仁寿县", "丹棱县", "青神县", "洪雅县", "其他"]
            }
        ]
    },
    {
        name: "贵州省",
        city: [{
                name: "贵阳市",
                district: ["观山湖区", "南明区", "云岩区", "花溪区", "乌当区", "白云区", "清镇市", "开阳县", "息烽县", "修文县", "其他"]
            },
            {
                name: "遵义市",
                district: ["汇川区", "红花岗区", "播州区", "赤水市", "仁怀市", "桐梓县", "绥阳县", "正安县", "道真县", "务川县", "凤冈县", "湄潭县", "余庆县", "习水县", "其他"]
            },
            {
                name: "六盘水市",
                district: ["钟山区", "盘州市", "六枝特区", "水城县", "其他"]
            },
            {
                name: "安顺市",
                district: ["西秀区", "平坝区", "镇宁县", "普定县", "关岭县", "紫云县", "其他"]
            },
            {
                name: "毕节市",
                district: ["七星关区", "赫章县", "威宁县", "纳雍县", "织金县", "黔西县", "金沙县", "大方县", "其他"]
            },
            {
                name: "铜仁市",
                district: ["碧江区", "万山区", "江口县", "玉屏县", "石阡县", "思南县", "印江县", "德江县", "沿河县", "松桃县", "其他"]
            },
            {
                name: "黔东南苗族侗族自治州",
                district: ["凯里市", "镇远县", "黄平县", "施秉县", "三穗县", "岑巩县", "天柱县", "锦屏县", "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县", "其他"]
            },
            {
                name: "黔南布依族苗族自治州",
                district: ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县", "长顺县", "龙里县", "惠水县", "三都县", "其他"]
            },
            {
                name: "黔西南布依族苗族自治州",
                district: ["兴义市", "兴仁市", "普安县", "晴隆县", "贞丰县", "望谟县", "册亨县", "安龙县", "其他"]
            }
        ]
    },
    {
        name: "云南省",
        city: [{
                name: "昆明市",
                district: ["呈贡区", "盘龙区", "五华区", "官渡区", "西山区", "晋宁区", "东川区", "安宁市", "富民县", "宜良县", "嵩明县", "石林彝族自治县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "其他"]
            },
            {
                name: "曲靖市",
                district: ["麒麟区", "沾益区", "马龙区", "宣威市", "富源县", "罗平县", "师宗县", "陆良县", "会泽县", "其他"]
            },
            {
                name: "玉溪市",
                district: ["红塔区", "江川区", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县", "其他"]
            },
            {
                name: "昭通市",
                district: ["昭阳区", "水富市", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "其他"]
            },
            {
                name: "保山市",
                district: ["隆阳区", "腾冲市", "施甸县", "龙陵县", "昌宁县", "其他"]
            },
            {
                name: "丽江市",
                district: ["古城区", "永胜县", "华坪县", "玉龙纳西族自治县", "宁蒗彝族自治县", "其他"]
            },
            {
                name: "普洱市",
                district: ["思茅区", "宁洱哈尼族彝族自治县", "墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县", "其他"]
            },
            {
                name: "临沧市",
                district: ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县", "其他"]
            },
            {
                name: "德宏傣族景颇族自治州",
                district: ["芒市", "瑞丽市", "梁河县", "盈江县", "陇川县", "其他"]
            },
            {
                name: "怒江傈僳族自治州",
                district: ["泸水市", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县", "其他"]
            },
            {
                name: "迪庆藏族自治州",
                district: ["香格里拉市", "德钦县", "维西傈僳族自治县", "其他"]
            },
            {
                name: "大理白族自治州",
                district: ["大理市", "祥云县", "宾川县", "弥渡县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县", "漾濞彝族自治县", "南涧彝族自治县", "巍山彝族回族自治县", "其他"]
            },
            {
                name: "楚雄彝族自治州",
                district: ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县", "其他"]
            },
            {
                name: "红河哈尼族彝族自治州",
                district: ["蒙自市", "个旧市", "开远市", "弥勒市", "建水县", "石屏县", "泸西县", "绿春县", "元阳县", "红河县", "金平苗族瑶族傣族自治县", "河口瑶族自治县", "屏边苗族自治县", "其他"]
            },
            {
                name: "文山壮族苗族自治州",
                district: ["文山市", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县", "其他"]
            },
            {
                name: "西双版纳傣族自治州",
                district: ["景洪市", "勐海县", "勐腊县", "其他"]
            }
        ]
    },
    {
        name: "陕西省",
        city: [{
                name: "西安市",
                district: ["新城区", "碑林区", "莲湖区", "雁塔区", "灞桥区", "未央区", "阎良区", "临潼区", "长安区", "高陵区", "鄠邑区", "蓝田县", "周至县", "其他"]
            },
            {
                name: "宝鸡市",
                district: ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县", "扶风县", "眉县", "陇县", "千阳县", "麟游县", "凤县", "太白县", "其他"]
            },
            {
                name: "咸阳市",
                district: ["秦都区", "杨陵区", "渭城区", "三原县", "泾阳县", "乾县", "礼泉县", "永寿县", "长武县", "旬邑县", "淳化县", "武功县", "兴平市", "彬州市", "其他"]
            },
            {
                name: "铜川市",
                district: ["王益区", "印台区", "耀州区", "宜君县", "其他"]
            },
            {
                name: "渭南市",
                district: ["临渭区", "华州区", "潼关县", "大荔县", "合阳县", "澄城县", "蒲城县", "白水县", "富平县", "韩城市", "华阴市", "其他"]
            },
            {
                name: "延安市",
                district: ["宝塔区", "安塞区", "延长县", "延川县", "子长市", "志丹县", "吴起县", "甘泉县", "富县", "洛川县", "宜川县", "黄龙县", "黄陵县", "其他"]
            },
            {
                name: "榆林市",
                district: ["榆阳区", "横山区", "神木市", "府谷县", "靖边县", "定边县", "绥德县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县", "其他"]
            },
            {
                name: "汉中市",
                district: ["汉台区", "南郑区", "城固县", "洋县", "西乡县", "勉县", "宁强县", "略阳县", "镇巴县", "留坝县", "佛坪县", "其他"]
            },
            {
                name: "安康市",
                district: ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县", "其他"]
            },
            {
                name: "商洛市",
                district: ["商州区", "洛南县", "丹凤县", "商南县", "山阳县", "镇安县", "柞水县", "其他"]
            }
        ]
    },
    {
        name: "甘肃省",
        city: [{
                name: "兰州市",
                district: ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "榆中县", "皋兰县", "其他"]
            },
            {
                name: "嘉峪关市",
                district: ["峪泉镇", "文殊镇", "新城镇", "其他"]
            },
            {
                name: "金昌市",
                district: ["金川区", "永昌县", "其他"]
            },
            {
                name: "白银市",
                district: ["白银区", "平川区", "会宁县", "靖远县", "景泰县", "其他"]
            },
            {
                name: "天水市",
                district: ["秦州区", "麦积区", "甘谷县", "武山县", "秦安县", "清水县", "张家川回族自治县", "其他"]
            },
            {
                name: "武威市",
                district: ["凉州区", "民勤县", "古浪县和天祝藏族自治县", "其他"]
            },
            {
                name: "张掖市",
                district: ["甘州区", "山丹县", "民乐县", "临泽县", "高台县", "肃南裕固族自治县", "其他"]
            },
            {
                name: "平凉市",
                district: ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭市", "庄浪县", "静宁县", "其他"]
            },
            {
                name: "酒泉市",
                district: ["肃州区", "玉门市", "敦煌市", "金塔县", "瓜州县", "肃北县", "阿克塞哈萨克族自治县", "其他"]
            },
            {
                name: "庆阳市",
                district: ["西峰区", "庆城", "华池", "宁县", "镇原", "合水", "正宁", "环县", "其他"]
            },
            {
                name: "定西市",
                district: ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县", "其他"]
            },
            {
                name: "陇南市",
                district: ["武都区", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "徽县", "两当县", "其他"]
            },
            {
                name: "临夏回族自治州",
                district: ["临夏市", "临夏县", "永靖县", "广河县", "和政县", "康乐县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县", "其他"]
            },
            {
                name: "甘南藏族自治州",
                district: ["合作市", "夏河", "碌曲", "玛曲", "迭部", "舟曲", "临潭", "卓尼县", "其他"]
            }
        ]
    },
    {
        name: "青海省",
        city: [{
                name: "西宁市",
                district: ["城中区", "城东区", "城西区", "城北区", "湟中区", "大通回族土族自治县", "湟源县", "其他"]
            },
            {
                name: "海东市",
                district: ["乐都区", "平安区", "民和回族土族自治县", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县", "其他"]
            },
            {
                name: "海北藏族自治州",
                district: ["海晏县", "祁连县", "刚察县", "门源回族自治县", "其他"]
            },
            {
                name: "黄南藏族自治州",
                district: ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县", "其他"]
            },
            {
                name: "海南藏族自治州",
                district: ["共和县", "同德县", "贵德县", "兴海县", "贵南县", "其他"]
            },
            {
                name: "果洛藏族自治州",
                district: ["玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县", "其他"]
            },
            {
                name: "玉树藏族自治州",
                district: ["玉树市", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县", "其他"]
            },
            {
                name: "海西蒙古族藏族自治州",
                district: ["德令哈市", "格尔木市", "茫崖市", "天峻县", "都兰县", "乌兰县", "其他"]
            }
        ]
    },
    {
        name: "台湾省",
        city: [{
                name: "台北市",
                district: ["中正区", "大同区", "中山区", "万华区", "信义区", "松山区", "大安区", "南港区", "北投区", "内湖区", "士林区", "文山区", "其他"]
            },
            {
                name: "新北市",
                district: ["板桥区", "汐止区", "新店区", "永和区", "中和区", "土城区", "树林区", "三重区", "新庄区", "芦洲区", "瑞芳区", "三峡区", "莺歌区", "淡水区", "万里区", "金山区", "深坑区", "石碇区", "平溪区", "双溪区", "贡寮区", "坪林区", "乌来区", "泰山区", "林口区", "五股区", "八里区", "三芝区", "石门区", "其他"]
            },
            {
                name: "桃园市",
                district: ["桃园区", "中坜区", "平镇区", "八德区", "杨梅区", "芦竹区", "大溪区", "龙潭区", "龟山区", "大园区", "观音区", "新屋区", "复兴区", "其他"]
            },
            {
                name: "台中市",
                district: ["中区", "东区", "南区", "西区", "北区", "北屯区", "西屯区", "南屯区", "太平区", "大里区", "雾峰区", "乌日区", "丰原区", "后里区", "潭子区", "大雅区", "神冈区", "石冈区", "东势区", "新社区", "和平区", "大肚区", "沙鹿区", "龙井区", "梧栖区", "清水区", "大甲区", "外埔区", "大安区", "其他"]
            },
            {
                name: "台南市",
                district: ["中西区", "东区", "南区", "北区", "安平区", "安南区", "永康区", "归仁区", "新化区", "左镇区", "玉井区", "楠西区", "南化区", "仁德区", "关庙区", "龙崎区", "官田区", "麻豆区", "佳里区", "西港区", "七股区", "将军区", "学甲区", "北门区", "新营区", "后壁区", "白河区", "东山区", "六甲区", "下营区", "柳营区", "盐水区", "善化区", "大内区", "山上区", "新市区", "安定区", "其他"]
            },
            {
                name: "高雄市",
                district: ["楠梓区", "左营区", "鼓山区", "三民区", "盐埕区", "前金区", "新兴区", "苓雅区", "前镇区", "旗津区", "小港区", "小港区", "凤山区", "大寮区", "鸟松区", "林园区", "仁武区", "大树区", "大社区", "冈山区", "路竹区", "桥头区", "梓官区", "弥陀区", "永安区", "燕巢区", "阿莲区", "茄萣区", "湖内区", "旗山区", "美浓区", "内门区", "杉林区", "甲仙区", "六龟区", "茂林区", "桃源区", "那玛夏区", "其他"]
            },
            {
                name: "基隆市",
                district: ["中正区", "七堵区", "暖暖区", "仁爱区", "中山区", "安乐区", "信义区", "其他"]
            },
            {
                name: "新竹市",
                district: ["东区", "北区", "香山区", "其他"]
            },
            {
                name: "嘉义市",
                district: ["东区", "西区", "其他"]
            },
            {
                name: "新竹县",
                district: ["竹北市", "竹东镇", "新埔镇", "关西镇", "新丰乡", "峨眉乡", "宝山乡", "五峰乡", "横山乡", "北埔乡", "尖石乡", "芎林乡", "湖口乡", "其他"]
            },
            {
                name: "苗栗县",
                district: ["苗栗市", "通霄镇", "苑里镇", "西湖乡", "头屋乡", "公馆乡", "铜锣乡", "三义乡", "竹南镇", "后龙镇", "造桥乡", "三湾乡", "南庄乡", "大湖乡", "卓兰镇", "狮潭乡", "泰安乡", "其他"]
            },
            {
                name: "彰化县",
                district: ["彰化市", "员林镇", "和美镇", "鹿港镇", "溪湖镇", "田中镇", "北斗镇", "二林镇", "线西乡", "伸港乡", "芬园乡", "秀水乡", "花坛乡", "福兴乡", "大村乡", "埔心乡", "埔盐乡", "永靖乡", "社头乡", "田尾乡", "二水乡", "埤头乡", "溪州乡", "竹塘乡", "芳苑乡", "大城乡", "其他"]
            },
            {
                name: "南投县",
                district: ["南投市", "草屯镇", "埔里镇", "集集镇", "竹山镇", "中寮乡", "国姓乡", "仁爱乡", "名间乡", "水里乡", "鱼池乡", "信义乡", "鹿谷乡", "其他"]
            },
            {
                name: "云林县",
                district: ["斗六市", "斗南镇", "虎尾镇", "土库镇", "西螺镇", "北港镇", "大埤乡", "褒忠乡", "东势乡", "台西乡", "仑背乡", "麦寮乡", "林内乡", "古坑乡", "莿桐乡", "二仑乡", "水林乡", "口湖乡", "四湖乡", "元长乡", "其他"]
            },
            {
                name: "嘉义县",
                district: ["太保市", "朴子市", "布袋镇", "大林镇", "民雄乡", "溪口乡", "新港乡", "六脚乡", "东石乡", "义竹乡", "鹿草乡", "水上乡", "中埔乡", "竹崎乡", "梅山乡", "番路乡", "大埔乡", "阿里山乡", "其他"]
            },
            {
                name: "屏东县",
                district: ["屏东市", "潮州镇", "东港镇", "恒春镇", "三地门乡", "雾台乡", "玛家乡", "九如乡", "里港乡", "高树乡", "盐埔乡", "长治乡", "麟洛乡", "竹田乡", "内埔乡", "万丹乡", "泰武乡", "来义乡", "万峦乡", "莰顶乡", "新埤乡", "南州乡", "林边乡", "琉球乡", "佳冬乡", "新园乡", "枋寮乡", "枋山乡", "春日乡", "狮子乡", "车城乡", "牡丹乡", "满州乡", "其他"]
            },
            {
                name: "宜兰县",
                district: ["宜兰市", "头城镇", "罗东镇", "苏澳镇", "礁溪乡", "壮围乡", "员山乡", "冬山乡", "五结乡", "三星乡", "大同乡", "南澳乡", "其他"]
            },
            {
                name: "花莲县",
                district: ["花莲市", "凤林镇", "玉里镇", "新城乡", "秀林乡", "吉安乡", "寿丰乡", "光复乡", "丰滨乡", "瑞穗乡", "万荣乡", "卓溪乡", "富里乡", "其他"]
            },
            {
                name: "台东县",
                district: ["台东市", "关山镇", "成功镇", "绿岛乡", "兰屿乡", "延平乡", "卑南乡", "鹿野乡", "海端乡", "池上乡", "东河乡", "长滨乡", "太麻里乡", "金峰乡", "大武乡", "达仁乡", "其他"]
            },
            {
                name: "澎湖县",
                district: ["马公市", "西屿乡", "望安乡", "七美乡", "白沙乡", "湖西乡", "其他"]
            },
            {
                name: "金门县",
                district: ["金城镇", "金湖镇", "金沙镇", "金宁乡", "烈屿乡", "乌丘乡", "其他"]
            },
            {
                name: "连江县",
                district: ["南竿乡", "北竿乡", "东引乡", "莒光乡", "其他"]
            }
        ]
    },
    {
        name: "内蒙古自治区",
        city: [{
                name: "呼和浩特市",
                district: ["回民区", "新城区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "武川县", "清水河县", "其他"]
            },
            {
                name: "包头市",
                district: ["昆都仑区", "东河区", "青山区", "石拐区", "九原区", "白云鄂博矿区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗", "其他"]
            },
            {
                name: "乌海市",
                district: ["海勃湾区", "海南区", "乌达区", "其他"]
            },
            {
                name: "赤峰市",
                district: ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗", "其他"]
            },
            {
                name: "通辽市",
                district: ["科尔沁区", "霍林郭勒市", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "其他"]
            },
            {
                name: "鄂尔多斯市",
                district: ["康巴什区", "东胜区", "准格尔旗", "达拉特旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗", "其他"]
            },
            {
                name: "呼伦贝尔市",
                district: ["海拉尔区", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市", "阿荣旗", "鄂伦春自治旗", "莫力达瓦达斡尔族自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "其他"]
            },
            {
                name: "巴彦淖尔市",
                district: ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗", "其他"]
            },
            {
                name: "乌兰察布市",
                district: ["集宁区", "丰镇市", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "其他"]
            },
            {
                name: "兴安盟",
                district: ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县", "其他"]
            },
            {
                name: "锡林郭勒盟",
                district: ["锡林浩特市", "二连浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县", "其他"]
            },
            {
                name: "阿拉善盟",
                district: ["阿拉善左旗", "阿拉善右旗", "额济纳旗", "其他"]
            }
        ]
    },
    {
        name: "广西壮族自治区",
        city: [{
                name: "南宁市",
                district: ["青秀区", "兴宁区", "西乡塘区", "江南区", "良庆区", "邕宁区", "武鸣区", "隆安县", "马山县", "上林县", "宾阳县", "横县", "其他"]
            },
            {
                name: "柳州市",
                district: ["柳北区", "柳南区", "柳江区", "城中区", "鱼峰区", "鹿寨县", "柳城县", "融安县", "融水苗族自治县", "三江侗族自治县", "其他"]
            },
            {
                name: "桂林市",
                district: ["象山区", "秀峰区", "叠彩区", "七星区", "雁山区", "临桂区", "阳朔县", "灵川县", "全州县", "平乐县", "兴安县", "灌阳县", "荔浦市", "资源县", "永福县", "龙胜各族自治县", "恭城瑶族自治县", "其他"]
            },
            {
                name: "梧州市",
                district: ["长洲区", "万秀区", "龙圩区", "岑溪市", "苍梧县", "蒙山县", "藤县", "其他"]
            },
            {
                name: "北海市",
                district: ["海城区", "银海区", "铁山港区", "合浦县", "其他"]
            },
            {
                name: "防城港市",
                district: ["港口区", "防城区", "东兴市", "上思县", "其他"]
            },
            {
                name: "钦州市",
                district: ["钦南区", "钦北区", "灵山县", "浦北县", "其他"]
            },
            {
                name: "贵港市",
                district: ["港北区", "港南区", "覃塘区", "桂平市", "平南县", "其他"]
            },
            {
                name: "玉林市",
                district: ["玉州区", "福绵区", "北流市", "容县", "陆川县", "博白县", "兴业县", "其他"]
            },
            {
                name: "百色市",
                district: ["右江区", "靖西市", "田阳区", "田东县", "平果县", "德保县", "那坡县", "凌云县", "乐业县", "田林县", "西林县", "隆林各族自治县", "其他"]
            },
            {
                name: "贺州市",
                district: ["八步区", "平桂区", "昭平县", "钟山县", "富川瑶族自治县", "其他"]
            },
            {
                name: "河池市",
                district: ["宜州区", "金城江区", "南丹县", "天峨县", "凤山县", "东兰县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", "罗城仫佬族自治县", "环江毛南族自治县", "其他"]
            },
            {
                name: "来宾市",
                district: ["兴宾区", "合山市", "象州县", "武宣县", "忻城县", "金秀瑶族自治县", "其他"]
            },
            {
                name: "崇左市",
                district: ["江州区", "凭祥市", "扶绥县", "宁明县", "龙州县", "大新县", "天等县", "其他"]
            }
        ]
    },
    {
        name: "西藏自治区",
        city: [{
                name: "拉萨市",
                district: ["城关区", "堆龙德庆区", "达孜区", "林周县", "尼木县", "当雄县", "曲水县", "墨竹工卡县", "其他"]
            },
            {
                name: "日喀则市",
                district: ["桑珠孜区", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县", "其他"]
            },
            {
                name: "昌都市",
                district: ["卡若区", "察雅县", "左贡县", "芒康县", "洛隆县", "边坝县", "江达县", "贡觉县", "丁青县", "八宿县", "类乌齐县", "其他"]
            },
            {
                name: "林芝市",
                district: ["巴宜区", "米林县", "墨脱县", "察隅县", "波密县", "朗县", "工布江达县", "其他"]
            },
            {
                name: "山南市",
                district: ["乃东区", "扎囊县", "贡嘎县", "桑日县", "琼结县", "洛扎县", "加查县", "隆子县", "曲松县", "措美县", "错那县", "浪卡子县", "其他"]
            },
            {
                name: "那曲市",
                district: ["色尼区", "申扎县", "班戈县", "聂荣县", "安多县", "嘉黎县", "巴青县", "比如县", "索县", "尼玛县", "双湖县", "其他"]
            },
            {
                name: "阿里地区",
                district: ["噶尔县", "普兰县", "札达县", "日土县", "革吉县", "改则县", "措勤县", "其他"]
            }
        ]
    },
    {
        name: "宁夏回族自治区",
        city: [{
                name: "银川市",
                district: ["兴庆区", "金凤区", "西夏区", "灵武市", "永宁县", "贺兰县", "其他"]
            },
            {
                name: "石嘴山市",
                district: ["大武口区", "惠农区", "平罗县", "其他"]
            },
            {
                name: "吴忠市",
                district: ["利通区", "红寺堡区", "青铜峡市", "同心县", "盐池县", "其他"]
            },
            {
                name: "固原市",
                district: ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县", "其他"]
            },
            {
                name: "中卫市",
                district: ["沙坡头区", "中宁县", "海原县", "其他"]
            }
        ]
    },
    {
        name: "新疆维吾尔自治区",
        city: [{
                name: "乌鲁木齐市",
                district: ["水磨沟区", "天山区", "沙依巴克区", "新市区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县", "其他"]
            },
            {
                name: "克拉玛依市",
                district: ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区", "其他"]
            },
            {
                name: "吐鲁番市",
                district: ["高昌区", "鄯善县", "托克逊县", "其他"]
            },
            {
                name: "哈密市",
                district: ["伊州区", "伊吾县", "巴里坤哈萨克自治县", "其他"]
            },
            {
                name: "阿克苏地区",
                district: ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县", "其他"]
            },
            {
                name: "喀什地区",
                district: ["喀什市", "疏附县", "疏勒县", "英吉沙县", "泽普县", "莎车县", "叶城县", "麦盖提县", "岳普湖县", "伽师县", "巴楚县", "塔什库尔干塔吉克自治县", "其他"]
            },
            {
                name: "和田地区",
                district: ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县", "其他"]
            },
            {
                name: "昌吉回族自治州",
                district: ["昌吉市", "阜康市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县", "其他"]
            },
            {
                name: "博尔塔拉蒙古自治州",
                district: ["博乐市", "阿拉山口市", "精河县", "温泉县", "其他"]
            },
            {
                name: "巴音郭楞蒙古自治州",
                district: ["库尔勒市", "焉耆回族自治县", "轮台县", "尉犁县", "若羌县", "且末县", "和静县", "和硕县", "博湖县", "其他"]
            },
            {
                name: "克孜勒苏柯尔克孜自治州",
                district: ["阿图什市", "阿克陶县", "阿合奇县", "乌恰县", "其他"]
            },
            {
                name: "伊犁哈萨克自治州",
                district: ["伊宁市", "奎屯市", "霍尔果斯市", "尼勒克县", "伊宁县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "察布查尔锡伯自治县", "其他"]
            },
            {
                name: "塔城地区",
                district: ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县", "其他"]
            },
            {
                name: "阿勒泰地区",
                district: ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县", "其他"]
            },
            {
                name: "石河子市",
                district: ["石河子市", "其他"]
            },
            {
                name: "阿拉尔市",
                district: ["阿拉尔市", "其他"]
            },
            {
                name: "图木舒克市",
                district: ["图木舒克市", "其他"]
            },
            {
                name: "五家渠市",
                district: ["五家渠市", "其他"]
            },
            {
                name: "北屯市",
                district: ["北屯市", "其他"]
            },
            {
                name: "铁门关市",
                district: ["铁门关市", "其他"]
            },
            {
                name: "双河市",
                district: ["双河市", "其他"]
            },
            {
                name: "可克达拉市",
                district: ["可克达拉市", "其他"]
            },
            {
                name: "昆玉市",
                district: ["昆玉市", "其他"]
            },
            {
                name: "胡杨河市",
                district: ["胡杨河市", "其他"]
            }
        ]
    },
    {
        name: "香港特别行政区",
        city: [{
            name: "香港特别行政区",
            district: ["中西区", "湾仔区", "东区", "南区 油尖旺区", "深水埗区", "九龙城区", "黄大仙区", "观塘区", "北区", "大埔区", "沙田区", "西贡区", "荃湾区", "屯门区", "元朗区", "葵青区", "离岛区", "其他"]
        }]
    },
    {
        name: "澳门特别行政区",
        city: [{
            name: "澳门特别行政区",
            district: ["花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区", "路氹城", "其他"]
        }]
    }
];