/**
 * calendar
 * @authors shikkya
 * @date 2024-09-01
 */

// 节假日
var specialDate = {
    '2023': {
        '01': {
            relax: [1, 2, 21, 22, 23, 24, 25, 26, 27],
            work: [28, 29]
        },
        '04': {
            relax: [5, 29, 30],
            work: [23]
        },
        '05': {
            relax: [1, 2, 3],
            work: [6]
        },
        '06': {
            relax: [22, 23, 24],
            work: [25]
        },
        '09': {
            relax: [29, 30],
            work: []
        },
        '10': {
            relax: [1, 2, 3, 4, 5, 6],
            work: [7, 8]
        }
    },
    '2024': {
        '01': {
            relax: [1],
            work: []
        },
        '02': {
            relax: [12, 13, 14, 15, 16],
            work: [4, 18]
        },
        '04': {
            relax: [4, 5],
            work: [7, 28]
        },
        '05': {
            relax: [1, 2, 3],
            work: [11]
        },
        '06': {
            relax: [10],
            work: []
        },
        '09': {
            relax: [16, 17],
            work: [14, 29]
        },
        '10': {
            relax: [1, 2, 3, 4, 7],
            work: [12]
        }
    }
};